{
    "plugins": {
        "256color": {
            "entry": "zsh-256color.plugin.zsh",
            "description": "This ZSH plugin enhances the terminal environment with 256 colors; the result is a multicolor terminal, if available."
        },
        "abbr": {
            "entry": "zsh-abbr.plugin.zsh",
            "description": "The zsh manager for auto-expanding abbreviations - text that when written in a terminal is replaced with other (typically longer) text. Inspired by fish shell."
        },
        "abbrev-alias": {
            "entry": "abbrev-alias.plugin.zsh",
            "description": "This zsh plugin provides functionality similar to Vim's abbreviation expansion."
        },
        "accurev": {
            "entry": "accurev.sh",
            "description": "ZSH plugin for accurev"
        },
        "alehouse": {
            "entry": "alehouse.plugin.zsh",
            "description": "Contains short aliases for Homebrew commands."
        },
        "almostontop": {
            "entry": "almostontop.plugin.zsh",
            "description": "It clears previous command output every time before new command executed in shell. Inspired by alwaysontop plugin for bash."
        },
        "ansible": {
            "entry": "ansible.plugin.zsh",
            "description": "Provides aliases for ansible"
        },
        "ansiweather": {
            "entry": "ansiweather.plugin.zsh",
            "description": "Shell script for displaying the current weather conditions in your terminal, with support for ANSI colors and Unicode symbols."
        },
        "antigen-git-rebase": {
            "entry": "git-rebase.zsh",
            "description": "ZSH script to aid with Git rebasing (also works with ZConfer)."
        },
        "appup": {
            "entry": "appup.plugin.zsh",
            "description": "Adds start, restart, stop, up, and down commands when it detects a docker-compose or Vagrant file in the current directory. Saves you typing docker-compose or vagrant every time or aliasing them."
        },
        "async": {
            "entry": "async.plugin.zsh",
            "description": "Can run multiple asynchronous jobs, enforce unique jobs (multiple instances of the same job will not run), flush all currently running jobs and create multiple workers (each with their own jobs). For each worker you can register a callback-function through which you will be notified about the job results (job name, return code, output and execution time)."
        },
        "auto-ls": {
            "entry": "auto-ls.plugin.zsh",
            "description": "Automatically ls when cding to a new directory."
        },
        "z": {
            "entry": "zsh-z.plugin.zsh",
            "description": "Jump quickly to directories that you have visited \"frecently.\" A native ZSH port of z.sh."
        }
    },
    "themes": {
        "absolute": {
            "entry": "absolute.zsh-theme",
            "description": "An extremely clean ZSH theme with git branch, git status, battery percentage, NVM node version, and last command exit code."
        },
        "af-magic": {
            "entry": "af-magic.zsh-theme",
            "description": "A clean ZSH theme with git, mercurial, and virtualenv support."
        },
        "agnoster": {
            "entry": "agnoster.zsh-theme",
            "description": "A cool ZSH theme with powerline glyphs."
        },
        "dracula": {
            "entry": "dracula.zsh-theme",
            "description": "Dark theme for ZSH and 109+ apps"
        }
    }
}